-- src/main/resources/db/migration/V2__insert_initial_data.sql

INSERT INTO areas (area_id, area_name) VALUES
(1, '서울특별시'),
(2, '부산광역시'),
(3, '대구광역시'),
(4, '인천광역시'),
(5, '광주광역시'),
(6, '대전광역시'),
(7, '울산광역시'),
(8, '세종특별자치시'),
(9, '경기도'),
(10, '강원특별자치도'),
(11, '충청북도'),
(12, '충청남도'),
(13, '전북특별자치도'),
(14, '전라남도'),
(15, '경상북도'),
(16, '경상남도'),
(17, '제주특별자치도');

INSERT INTO categories (category_id, category_name) VALUES
(1, '디지털기기'),
(2, '생활가전'),
(3, '가구/인테리어'),
(4, '생활/주방'),
(5, '유아동'),
(6, '유아도서'),
(7, '여성의류'),
(8, '여성잡화'),
(9, '남성패션/잡화'),
(10, '뷰티/미용'),
(11, '스포츠/레저'),
(12, '취미/게임/음반'),
(13, '도서'),
(14, '티켓/교환권'),
(15, '가공식품'),
(16, '건강기능식품'),
(17, '반려동물용품'),
(18, '식물'),
(19, '기타 중고물품'),
(20, '삽니다');

INSERT INTO cancelation_reasons (cancelation_reason_id, cancelation_reason_type) VALUES
(1, '단순 변심'),
(2, '상품 정보 오류'),
(3, '판매자와 연락 불가'),
(4, '질병'),
(5, '사고 및 재난'),
(6, '도난/사기 물품 의심');

INSERT INTO report_reasons (report_reason_id, report_reason_type) VALUES
(1, '불쾌한 언어 사용'),
(2, '광고/스팸'),
(3, '부적절한 게시물'),
(4, '거래 무단 파기');
